/**
 * Написать функцию, которая по заданному целому числу, большему нуля, вычисляет сумму его десятичных цифр.
 * Рекурсия основана на том, что задачу можно свести к ней же самой, но для числа с меньшим числом цифр.
 */
public class Task1 {
    private static int digits(int n) {
        // Здесь будет ваша реализация
        return 0;
    }

    public static void main(String[] args) {
        System.out.println(digits(239));
        // Напечатает 14
    }
}
